Revit 2024 API
TagMode Enumeration
 The modes of tag creation that are supported for IndependentTags.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum TagMode
Visual Basic
Public Enumeration TagMode
Visual C++
public enum class TagMode
Members
Member name | Description
TM_ADDBY_CATEGORY |  Add a single category tag.
TM_ADDBY_MULTICATEGORY |  Add a multi-category tag.
TM_ADDBY_MATERIAL |  Add a material tag.
See Also
Autodesk.Revit.DB Namespace